app/controllers/friend_requests_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "friend_requests" ("created_at", "from_id", "state", "to_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 15 Apr 2013 17:49:04 UTC +00:00], ["from_id", 2], ["state", nil], ["to_id", 1], ["updated_at", Mon, 15 Apr 2013 17:49:04 UTC +00:00]]
---
	def create
		to = params[:friend_request][:to] #get the "to"
		user = User.find(to) # find the user
		FriendRequest.create(:from => current_user, :to => user) # create the friend request from us to them

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "friend_requests" SET "state" = 'pending', "updated_at" = '2013-04-15 18:46:03.259454' WHERE "friend_requests"."id" = 1
---
	def update #we will get an id of the friend request and the state

	  id = params[:id] # get the id
	  state = params[:friend_request][:state] #get the state
	  request = FriendRequest.find(id) #model - get the id form the object
	  if request.to == current_user
  	  request.state = state
  	  request.save