app/controllers/profiles_controller.rb

	def show
		# take the parameter from url
		user_name = params[:id]
		# find user, 'find_by' method is dynamically generated
		@user = User.find_by_user_name(user_name)
		@already_sent = FriendRequest.exists?(:from_id => current_user.id, :to_id => @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = 'kasi' LIMIT 1
SELECT 1 AS one FROM "friend_requests" WHERE "friend_requests"."from_id" = 1 AND "friend_requests"."to_id" = 1 LIMIT 1